/*==============================================================================

   ゲーム処理 [game.cpp]
														 Author :
														 Date   :
--------------------------------------------------------------------------------

==============================================================================*/

#include "game.h"
#include "main.h"
#include "input.h"
#include "fade.h"
#include "sound.h"
#include "camera.h"
#include "light.h"
#include "ui.h"

#include "stage.h"
#include "player.h"
#include "character.h"
#include "classResource.h"
/*------------------------------------------------------------------------------
   定数定義
------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
   構造体宣言
------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
   プロトタイプ宣言
------------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
   グローバル変数の定義
------------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
   初期化関数
------------------------------------------------------------------------------*/
Game::Game(STAGE stage_, CHARACTER character)
{

	// カメラの初期化
	camera = new Camera();
	// ライトの初期化
	InitLight();

	stage = GetStage(stage_, character);
	ui = new UI(stage);
	SetLightEnable(true);


}

Game::~Game(void)
{
	delete ui;
	delete stage;
	delete camera;
}

/*------------------------------------------------------------------------------
   更新処理をする関数
------------------------------------------------------------------------------*/
void Game::Update(void)
{
	camera->Update(stage->GetPlayer()->GetCharacter());
	if (stage)
		stage->Update(camera);
	if (ui)
		ui->Update(stage->GetPlayer()->GetCharacter());
}

/*------------------------------------------------------------------------------
   描画処理をする関数
------------------------------------------------------------------------------*/
void Game::Draw(void)
{
	camera->SetCameraAT({stage->GetPlayer()->GetCharacter()->GetPos().x, 0.0, stage->GetPlayer()->GetCharacter()->GetPos().z });
	camera->SetCamera();
	// 深度テスト有効
	SetDepthEnable(true);

	// ライティング有効
	SetLightEnable(true);

	if(stage)
	stage->Draw();

	// マトリクス設定
	SetWorldViewProjection2D();//座標の2D変換
	// 2D描画なので深度無効
	SetDepthEnable(false);

	// uiの描画処理
	if(ui)
	ui->Draw();

}

